app/Http/Controllers/CategoryController.php

    public function index()
    {
        $data['categories'] = Category::latest('id')->paginate(20);
---
select * from `categories` where `categories`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `categories` where `categories`.`deleted_at` is null